In [33]:
import pandas as pd
import sqlite3

In [34]:
conn = sqlite3.connect('dogs.db')
c = conn.cursor()

In [35]:
c.execute('''SELECT *
             FROM dogs;''')
df = pd.DataFrame(c.fetchall()) #Take results and create dataframe
df.columns = [i[0] for i in c.description]
df.head()

       Name             Breed House_Number Owner_ID
0       Rex         Chihuahua            1        3
1  Clifford   German Shepherd            2        2
2     Lucky          Daschund            3        1
3      Bobo          Shih-Tzu            2        4
4     Buddy  Golden Retriever            4        2

In [36]:
conn = sqlite3.connect('cats.db')
c = conn.cursor()

In [37]:
c.execute('''SELECT *
             FROM cats;''')
df = pd.DataFrame(c.fetchall()) #Take results and create dataframe
df.columns = [i[0] for i in c.description]
df.head()

       Name         Breed House_Number Owner_ID
0      Bell       Siamese            1        4
1   Jackson      Balinese            2        3
2  Precious     Himalayan            3        4
3     Rocky  Egyptian Mau            4        2
4    Samson      Javanese            5        1

In [47]:
conn = sqlite3.connect('pets.db')
c = conn.cursor()

In [39]:
!ls

3_2_sql_joins.md            dogs.db
Untitled.ipynb              owners.db
cat_dog_owner_sqlite3.ipynb pets.db
cats.db

In [48]:
c.execute('''SELECT *
             FROM sqlite_master
             WHERE type='table';''')
df = pd.DataFrame(c.fetchall()) #Take results and create dataframe
df.columns = [i[0] for i in c.description]
df.head()

,type,name,tbl_name,rootpage,sql
0,table,owners,owners,2,"CREATE TABLE owners(\n ""Name"" TEXT,\n ""Phone..."
1,table,dogs,dogs,3,"CREATE TABLE dogs(\n ""Name"" TEXT,\n ""Breed"" ..."
2,table,cats,cats,4,"CREATE TABLE cats(\n ""Name"" TEXT,\n ""Breed"" ..."

In [69]:
c.execute('''SELECT *
             FROM dogs;''')
df = pd.DataFrame(c.fetchall()) #Take results and create dataframe
df.columns = [i[0] for i in c.description]
df.head()

                     Name       Phone            Address ID
0            Josh Daniell  3132879573         1440 G st.  1
1  Alison Peebles Madigan  2147098190               None  2
2            Avi Flombaum  4698780125  1776 New York Ave  3
3           Justin Bieber  4103810987               None  4

In [54]:
c.execute('''SELECT *
             FROM cats;''')
df = pd.DataFrame(c.fetchall()) #Take results and create dataframe
df.columns = [i[0] for i in c.description]
df.head()

       Name         Breed House_Number Owner_ID
0      Bell       Siamese            1        4
1   Jackson      Balinese            2        3
2  Precious     Himalayan            3        4
3     Rocky  Egyptian Mau            4        2
4    Samson      Javanese            5        1

In [53]:
c.execute('''SELECT *
             FROM owners;''')
df = pd.DataFrame(c.fetchall()) #Take results and create dataframe
df.columns = [i[0] for i in c.description]
df.head()

                     Name       Phone            Address ID
0            Josh Daniell  3132879573         1440 G st.  1
1  Alison Peebles Madigan  2147098190               None  2
2            Avi Flombaum  4698780125  1776 New York Ave  3
3           Justin Bieber  4103810987               None  4

In [42]:
c.execute ('''select name from sqlite_master where type = 'table';''').fetchall()

[('owners',), ('dogs',), ('cats',)]

In [43]:
conn = sqlite3.connect('owners.db')
c = conn.cursor()

In [ ]:
#Write the appropriate SQL queries to satisfy the following prompts:






#Grab the names and phone numbers of owners with pets in house 4 that do not currently have an address.

In [56]:
#A. Write a SQL query that can grab the names of all pets owned by the founder of Flatiron School, Avi Flombaum

c.execute('''SELECT owners.Name as ownerName, dogs.Name as dogName, cats.Name as catName
             FROM owners JOIN dogs ON owners.ID = dogs.Owner_ID
                         JOIN cats ON owners.ID = cats.Owner_ID;
          ''')
df = pd.DataFrame(c.fetchall()) #Take results and create dataframe
df.columns = [i[0] for i in c.description]
df.head()

                ownerName   dogName  catName
0            Josh Daniell     Lucky   Samson
1  Alison Peebles Madigan     Buddy    Rocky
2  Alison Peebles Madigan  Clifford    Rocky
3  Alison Peebles Madigan       Leo    Rocky
4            Avi Flombaum       Rex  Jackson

In [58]:
#A. Write a SQL query that can grab the names of all pets owned by the founder of Flatiron School, Avi Flombaum
c.execute('''SELECT owners.Name as ownerName, dogs.Name as dogName, cats.Name as catName
             FROM owners JOIN dogs ON owners.ID = dogs.Owner_ID
                         JOIN cats ON owners.ID = cats.Owner_ID
             WHERE owners.Name = 'Avi Flombaum';
          ''')
df = pd.DataFrame(c.fetchall()) #Take results and create dataframe
df.columns = [i[0] for i in c.description]
df.head()

      ownerName dogName  catName
0  Avi Flombaum     Rex  Jackson

In [73]:
#B. Which House_Number contains the most number of pets in it and how many?
c.execute('''SELECT owners.Name, count(*)
             FROM owners JOIN dogs ON owners.ID = dogs.Owner_ID
                         JOIN cats ON owners.ID = cats.Owner_ID
             GROUP BY  owners.Name;
          ''')
df = pd.DataFrame(c.fetchall()) #Take results and create dataframe
df.columns = [i[0] for i in c.description]
df.head()

                     Name  count(*)
0  Alison Peebles Madigan         3
1            Avi Flombaum         1
2            Josh Daniell         1
3           Justin Bieber         2

In [83]:
#B. How many pets each House_Number contains?
c.execute('''SELECT House_Number, count(*) as Total_Pets
             FROM
                 (
                 SELECT *
                 FROM dogs
                 UNION
                 SELECT *
                 FROM cats
                 )
             GROUP BY House_Number;
          ''')
df = pd.DataFrame(c.fetchall()) #Take results and create dataframe
df.columns = [i[0] for i in c.description]
df.head(100)

  House_Number  Total_Pets
0            1           3
1            2           3
2            3           2
3            4           2
4            5           1

In [85]:
#B. Which House_Number contains the most number of pets in it and how many?
c.execute('''SELECT House_Number, count(*) as Total_Pets
             FROM
                 (
                 SELECT *
                 FROM dogs
                 UNION
                 SELECT *
                 FROM cats
                 )
             GROUP BY House_Number
             ORDER BY Total_Pets DESC
             LIMIT 1;
          ''')
df = pd.DataFrame(c.fetchall()) #Take results and create dataframe
df.columns = [i[0] for i in c.description]
df.head(100)

  House_Number  Total_Pets
0            1           3

In [ ]:
#C. The daycare realized that House 4 needs the owners of its pets to update their addresses. 

print"need to update addresses"